Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-54-56.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ལ་ནི་མངོན་དུ་གྱུར།
en: He was focused on the conduct of the bodhisattva Samanta­bhadra.

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྨོན་ལམ་གྱི་བྱིན་གྱིས་ནི་བྱིན་དུ་བརླབས།
en: He was blessed by the prayers of the bodhisattva Samanta­bhadra.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་ལ་ནི་མངོན་པར་མོས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་རླབས་པོ་ཆེ་ལ་ནི་ཤིན་ཏུ་ངེས་པའི་སྟོབས་དང་ཤུགས་ནི་རབ་ཏུ་ཐོབ།
en: He aspired to the range of conduct of all the tathāgatas. He had attained the strength and power of certainty in the immense field of activity of the bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་མཐོང་ན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པ་དང་འདྲ་བར་ནི་སེམས།
en: He thought that seeing the bodhisattva Samanta­bhadra would be the same as attaining omniscience.

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་མཐོང་བར་བྱ་བ་ལ་དབང་པོ་ནི་མངོན་དུ་གྱུར་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་མཐོང་བར་བྱ་བ་ལ་བརྩོན་འགྲུས་ཀྱི་ཤུགས་ཆེན་པོ་ནི་ཐོབ།
en: His faculties were directed to seeing the bodhisattva Samanta­bhadra. He had gained the great power of diligence for seeing the bodhisattva Samanta­bhadra. He applied himself with unflagging diligence in seeking the sight of the bodhisattva Samanta­bhadra. With the wheel of his faculties facing in all directions; with the body of a bodhisattva that has reached the all-seeing range of perception;

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་ཡོངས་སུ་བཙལ་བ་ལ་བརྩོན་འགྲུས་ཕྱིར་མི་ལྡོག་པའི་སྦྱོར་བ་དང་ནི་ལྡན་ཕྱོགས་ཐམས་ཅད་དུ་མངོན་དུ་གྱུར་པའི་དབང་པོའི་འཁོར་ལོ་དང་ཀུན་ཏུ་ལྟ་བས་ཡུལ་ཡོངས་སུ་གནོན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་དང་སངས་རྒྱས་མ་ལུས་པའི་ཞབས་ཀྱི་དྲུང་ན་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་འདུག་པའི་རྗེས་སུ་འབྲང་བའི་སེམས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དམིགས་པར་བྱ་བ་ལ་ཡང་དག་པར་བཏང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་དམིགས་པ་ཡོངས་སུ་བཙལ་བ་དང་མི་འབྲལ་བའི་བསམ་པ་དང་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་མཐོང་བར་བྱ་བའི་འདུ་ཤེས་ཀྱི་རྣམ་པའི་སྙིང་པོ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱི་མྱིག་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་ལམ་ལ་ཞུགས་པ་དང་། ནམ་མཁའི་དབྱིངས་ལྟར་ཡངས་པའི་བསམ་པ་དང་། སྙིང་རྗེ་ཆེན་པོའི་རྡོ་རྗེ་ཐོགས་པའི་ལྷག་པའི་བསམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་རྗེས་སུ་འབྲངས་པར་སྨོན་པ།
en: with a mind fixed on the bodhisattva Samanta­bhadra as being present at the feet of all buddhas without exception; with a focus on all buddhas as the object of his perception; with an aspiration that never ceased to seek the bodhisattva Samanta­bhadra as an object of perception; with the eyes of wisdom that follow the path of the bodhisattva Samanta­bhadra having as their essence the idea of seeing the bodhisattva Samanta­bhadra; with an aspiration that was as vast as space; with a higher motivation that possessed the thunderbolt of great compassion; with the prayer to follow the bodhisattva Samanta­bhadra;

source: ཕྱི་མའི་མཐའི་བསྐལ་པའི་མུར་ཐུག་པར་བྱིན་གྱིས་བརླབས་པ་དང་། ཡོངས་སུ་གནོན་པའི་རྩལ་རྣམ་པར་དག་པ།
en: with the blessing that lasts till the last of future kalpas; with the pure power of ascension;

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་མཉམ་པ་ཉིད་ཀྱི་རྗེས་སུ་སོང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་ས་ལ་གནས་པའི་ཡེ་ཤེས་ལ་རྣམ་པར་དཔྱོད་པ།
en: by following the same conduct as that of the bodhisattva Samanta­bhadra; by dwelling in the wisdom that is established on the level of the bodhisattva Samanta­bhadra; by residing in the field of perception of all tathāgatas;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུལ་ལ་ཡང་དག་པར་གནས་པ་དང་མི་ལྡན་པ་དེས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་མཉམ་པ་ཉིད་རྗེས་སུ་ཐོབ་པ། དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་རྗེས་སུ་སོང་བ། བསམ་གྱིས་མི་ཁྱབ་པའི་ཡུལ་དང་ལྡན་པ། མི་འཕྲོགས་པའི་སྤྱོད་ཡུལ་ཅན་མུ་མེད་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་དང་ལྡན་པ། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་ལྟ་བ། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་ཟིལ་གྱིས་གནོན་པ།
en: and by possessing those qualities, he saw the bodhisattva Samanta­bhadra, who had attained equality with all tathāgatas, who followed the three times equally, who possessed an inconceivable field of perception, who had an inviolable conduct, who had a limitless field of perception of wisdom, who was looked upon by all bodhisattvas, who could not be surpassed by all worlds, who was followed by all assemblies of followers, and who possessed a superior field of perception.

source: འཁོར་གྱི་དཀྱིལ་འཁོར་འཁོར་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འབྲང་བ། མངོན་པར་འཕགས་པའི་ཡུལ་དང་ལྡན་པ་དེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་ཀྱི་སྤྱན་སྔར་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ན་ནི་འདུག །བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་ནི་ཡོངས་སུ་བསྐོར། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་གྱིས་ནི་མདུན་དུ་བྱས་ཤིང་། སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་པད་མོ་ཆེན་པོའི་སྙིང་པོ་ཅན་ཞིག་ལ་འདུག་པ་མཐོང་སྟེ།
en: He was seated on a great precious lotus on the center of a lion throne in front of the Tathāgata Arhat Samyak­saṃbuddha, the Bhagavat Vairocana, with an ocean of an assembly of bodhisattva followers, at the head of a gathering of bodhisattvas.

source: དེས་དེའི་བ་སྤུའི་བུ་ག་ཐམས་ཅད་ཀྱི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འོད་ཟེར་གྱི་སྤྲིན་མང་པོ་འཐོན་ནས། འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ་ནམ་མཁའི་མཐས་གཏུགས་པ་ཐམས་ཅད་རབ་ཏུ་སྣང་བར་བྱས་ནས། སེམས་ཅན་རྣམས་ཀྱི་སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་བྱེད་པ་མཐོང་ངོ་། །དེས་དེའི་ལུས་ལས་འོད་ཀྱི་དཀྱིལ་འཁོར་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་སྤྲིན་མང་པོ་ཁ་དོག་སྣ་ཚོགས་ཅན་མང་པོ་འཐོན་ཏེ།
en: He saw that from all the pores on his body, from each of those pores, emerged multitudes of clouds of light rays that illuminated all world realms throughout the extent of the realm of phenomena to its limits and brought an end to the suffering of beings.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དགའ་བ་དང་། མོས་པའི་ཤུགས་རྒྱ་ཆེན་པོ་རྣམ་པར་འཕེལ་བར་བྱེད་པ་མཐོང་ངོ་།
en: He saw him increasing the vast power of joy and aspiration in all bodhisattvas.

source: །སྤྱི་བོ་དང་ཕྲག་པའི་ལྷུན་གཉིས་དང་། བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་ཀྱང་སྤོས་འོད་འཕྲོ་བའི་སྤྲིན་གྱི་ཆར་ཁ་དོག་སྣ་ཚོགས་སུ་འདུག་པ་མང་པོ་མངོན་པར་འཐོན་ནས། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱས་པར་བཀང་སྟེ།
en: He saw emanating from the crown of his head, his two shoulders, and all his pores a multitude of clouds of perfumes and lights of various colors, which spread throughout the assemblies of the followers of all tathāgatas and let fall their rain.

source: མངོན་པར་འབབ་པ་མཐོང་ངོ་། །བ་སྤུའི་བུ་ག་ཐམས་ཅད་ལས་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་མེ་ཏོག་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་ཆར་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མང་པོ་མངོན་པར་འཐོན་ནས། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱས་པར་བཀང་སྟེ།
en: He saw that from all the pores on his body, from each of those pores, emerged multitudes of clouds of all flowers, which were as numerous as the atoms in all buddha realms and which spread throughout the assemblies of the followers of all tathāgatas and let fall their rain.

source: མངོན་པར་འབབ་པ་མཐོང་ངོ་། །བ་སྤུའི་བུ་ག་ཐམས་ཅད་ལས་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་སྤོས་སྣ་ཚོགས་ཀྱི་ཤིང་གི་སྤྲིན་མང་པོ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མངོན་པར་འཐོན་ནས། ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའི་དབྱིངས་ཀྱི་མཐས་ཀླས་པ་ཐམས་ཅད་རྒྱས་པར་བཀང་ནས། སྤོས་ཀྱི་ཤིང་གི་སྤྲིན་གྱི་རྒྱན་གྱིས་བརྒྱན་པར་བྱས་ཏེ། སྤོས་དང་ཕྱེ་མ་དང་བདུག་པའི་མཛོད་ཟད་མི་ཤེས་པའི་ཆར་རབ་ཏུ་འགྱེད་ཅིང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱས་པར་བཀང་སྟེ།
en: He saw that from all the pores on his body, from each of those pores, emerged multitudes of clouds of various aromatic trees, which were as numerous as the atoms in all buddha realms and which spread throughout the realm of phenomena, throughout the entire realm of space to its limits, adorning it with the clouds of aromatic trees, letting fall a rain of an inexhaustible treasure of perfume, aromatic powders, and incense and spreading throughout the assemblies of the followers of all tathāgatas and letting fall their rain.

source: མངོན་པར་འབབ་པར་བྱེད་པ་མཐོང་ངོ་། །བ་སྤུའི་སྒོ་ཐམས་ཅད་ལས་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་གོས་སྣ་ཚོགས་ཀྱི་སྤྲིན་མང་པོ་མངོན་པར་འཐོན་ཏེ། ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའི་དབྱིངས་ཀྱི་མཐས་ཀླས་པ་ཐམས་ཅད་ཀུན་ནས་ཡོག་པར་བྱས་ནས་བརྒྱན་པར་མཐོང་ངོ་།
en: He saw that from all the pores on his body, from each of those pores, emerged multitudes of clouds of various clothes, which spread over and adorned the entire realm of phenomena, the entire realm of space.

source: །བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་དར་སྣ་ཚོགས་ཀྱི་ལྡ་ལྡིའི་སྤྲིན་དང་ཕྲེང་བ་སྣ་ཚོགས་ཀྱི་སྤྲིན་དང་། མུ་ཏིག་སྣ་ཚོགས་ཀྱི་སྤྲིན་དང་ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་སྤྲིན་གྱི་ཆར་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མངོན་པར་འཐོན་ནས། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱས་པར་བཀང་སྟེ། མངོན་པར་འབབ་པ་མཐོང་ངོ་།
en: He saw that from all the pores on his body, from each of those pores, emerged clouds of streamers of silks in various colors, clouds of various garlands, clouds of various pearls, and clouds of wish-fulfilling precious jewels, which were as numerous as the atoms in all buddha realms and which spread throughout the assemblies of the followers of all tathāgatas and let fall their rain.

source: །བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བསྒྲུབ་པའི་ཕྱིར། རིན་པོ་ཆེའི་ཤིང་གི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མངོན་པར་འཐོན་ཏེ། ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའི་མཐས་ཀླས་པ་ཐམས་ཅད་རྒྱས་པར་བཀང་ནས། རིན་པོ་ཆེའི་ཤིང་ལས་རིན་པོ་ཆེའི་མཛོད་རྣམ་པར་འཕྲོ་བའི་རྒྱན་གྱིས་བརྒྱན་པར་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དག་ཏུ་རིན་པོ་ཆེའི་ཆར་ཆེན་པོ་མངོན་པར་འབབ་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw that from all the pores on his body, from each of those pores, in order to fulfill the wishes of all beings, there emerged clouds of jewel trees, which were as numerous as the atoms in all buddha realms and which spread throughout the realm of phenomena, throughout the entire realm of space to its limits, adorning the buddha realms with treasures of jewels emanated from the jewel trees and spreading throughout the assemblies of the followers of all tathāgatas and letting fall their rain.

source: །བ་སྤུའི་བུ་ག་ཐམས་ཅད་ལས་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་གཟུགས་ཀྱི་ཁམས་ཀྱི་ལྷའི་རིས་ཀྱི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མངོན་པར་འཐོན་ནས། བྱང་ཆུབ་སེམས་དཔའ་ལ་ཡང་དག་པར་བསྔགས་པ་བྱེད་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རྒྱས་པར་འགེངས་པ་མཐོང་ངོ་།
en: He saw that from all the pores on his body, from each of those pores, emerged clouds of devas of the form realm, who were as numerous as the atoms in all buddha realms and who praised the bodhisattva and spread throughout all buddha realms.

source: །བ་སྤུའི་བུ་ག་ཐམས་ཅད་ལས་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་ཚངས་པའི་རྒྱུད་དུ་གཏོགས་པའི་ལྷའི་རིས་ཐམས་ཅད་དུ་སྤྲུལ་པའི་སྤྲིན་མང་པོ་མངོན་པར་འཐོན་ཏེ། མངོན་པར་སངས་རྒྱས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་གསོལ་བ་འདེབས་པར་མཐོང་ངོ་།
en: He saw that from all the pores on his body, from each of those pores, emerged clouds of emanated devas of the Brahmā paradises, who supplicated the tathāgatas to turn the wheel of the Dharma.

source: །བ་སྤུའི་བུ་ག་ཐམས་ཅད་ཀྱི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་འདོད་པའི་ཁམས་ཐམས་ཅད་དུ་གཏོགས་པའི་ལྷའི་དབང་པོའི་ལུས་ཀྱི་སྤྲིན་མང་པོ་མངོན་པར་འཐོན་ཏེ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་མང་པོ་ཡང་དག་པར་འཛིན་པར་མཐོང་ངོ་།
en: He saw that from all the pores on his body, from each of those pores, emerged multitudes of clouds of the bodies of the deva lords from within the entire desire realm, who held many wheels of Dharma of all the tathāgatas.

source: །བ་སྤུའི་བུ་ག་ཐམས་ཅད་ཀྱི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་གི་སྤྲིན་དུས་གསུམ་དུ་གཏོགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དང་འདྲ་བ། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མངོན་པར་འཐོན་ནས། ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའི་མཐས་ཀླས་པ། ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ། སེམས་ཅན་གནས་མེད་པ་དང་སྐྱབས་མྱེད་པ་དང་རྟེན་མྱེད་པ་རྣམས་ཀྱི་གནས་དང་། སྐྱབས་དང་རྟེན་དུ་གྱུར་པར་མཐོང་ངོ་བ་སྤུའི་བུ་ག་ཐམས་ཅད་ཀྱི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་།
en: He saw that from all the pores on his body, from each of those pores, there emerged, with each instant of mind, clouds of buddha realms that resembled all the buddha realms within the three times and were as numerous as the atoms in all buddha realms, and they spread throughout the realm of phenomena, throughout the entire realm of space to its limits, becoming a dwelling, a refuge, and a basis for beings without a dwelling, without a refuge, and without a basis.

source: སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ། སངས་རྒྱས་འབྱུང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་གང་བའི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མངོན་པར་འཐོན་ནས། ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའི་མཐས་ཀླས་པ་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ། སེམས་ཅན་མོས་པ་རླབས་པོ་ཆེ་རྣམས་ཡོངས་སུ་དག་པར་སྒྲུབ་པ་མཐོང་ངོ་།
en: He saw that from all the pores on his body, from each of those pores, there emerged, with each instant of mind, clouds filled with pure buddha realms, the appearances of buddhas, and all the assemblies of bodhisattva followers, which were as numerous as the atoms in all buddha realms, spreading throughout the realm of phenomena, throughout the entire realm of space to its limits, accomplishing the purification of beings with powerful aspirations.

source: །བ་སྤུའི་བུ་ག་ཐམས་ཅད་ལས་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་དག་པ་ལ་ཀུན་ནས་ཉོན་མོངས་པ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་སྤྲིན་མང་པོ་མངོན་པར་འཐོན་ནས། ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའི་དབྱིངས་ཀྱི་མཐས་ཀླས་པ་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ་ཀུན་ནས་ཉོན་མོངས་པའི་སེམས་ཅན་རྣམས་རྣམ་པར་དག་པར་སྒྲུབ་པ་མཐོང་ངོ་།
en: He saw that from all the pores on his body, from each of those pores, there emerged, with each instant of mind, multitudes of clouds of various defiled pure realms, which were as numerous as the atoms in all buddha realms and which spread throughout the realm of phenomena, throughout the entire realm of space to its limits, accomplishing the purification of beings afflicted by the kleśas.

source: །བ་སྤུའི་བུ་ག་རེ་རེའི་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་སངས་རྒྱས་ཀྱི་ཞིང་ཀུན་ནས་ཉོན་མོངས་ལ་རྣམ་པར་དག་པ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་སྤྲིན་མང་པོ་མངོན་པར་འཐོན་ནས། ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའི་དབྱིངས་ཀྱིས་ཀླས་པ་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ། སེམས་ཅན་གཅིག་ཏུ་ཀུན་ནས་ཉོན་མོངས་པ་རྣམས་རྣམ་པར་དག་པར་སྒྲུབ་པ་མཐོང་ངོ་།
en: He saw that from all the pores on his body, from each of those pores, there emerged, with each instant of mind, multitudes of clouds of purified defiled realms, which were as numerous as the atoms in all buddha realms and which spread throughout the realm of phenomena, throughout the entire realm of space to its limits, accomplishing the purification of every single being afflicted by the kleśas.

source: །བ་སྤུའི་བུ་ག་ཐམས་ཅད་ལས་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མངོན་པར་འཐོན་ཏེ། སེམས་ཅན་གྱི་ཁམས་ནམ་མཁའི་དབྱིངས་ཀྱིས་ཀླས་པ་ཐམས་ཅད་རྒྱས་པར་བཀང་ནས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པའི་རྗེས་སུ་འབྲང་བར་བྱེད་ཅིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw that from all the pores on his body, from each of those pores, emerged clouds of the bodies of all beings, which were as numerous as the atoms in all buddha realms and which spread throughout the realms of beings, throughout the entire realm of space to its limits, following the conducts of beings and ripening all beings for the highest, complete enlightenment.

source: །བ་སྤུའི་བུ་ག་ཐམས་ཅད་ལས་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་སྤྲིན་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མངོན་པར་འཐོན་ནས། ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའི་དབྱིངས་ཀྱིས་ཀླས་པ། ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་རྣམ་པར་འཕེལ་བར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་མཚན་མང་པོ་བརྗོད་པར་བྱེད་པ་མཐོང་ངོ་། །བ་སྤུའི་བུ་ག་ཐམས་ཅད་ལས་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མངོན་པར་འཐོན་ཏེ།
en: He saw that from all the pores on his body, from each of those pores, there emerged, with each instant of mind, clouds of the bodies of bodhisattvas, which were as numerous as the atoms in all buddha realms and which spread throughout the realm of phenomena, throughout the entire realm of space to its limits, reciting the multitude of names of all buddhas in order to increase the roots of merit of beings.

source: ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའི་དབྱིངས་ཀྱིས་ཀླས་པ་ཐམས་ཅད་རྒྱས་པར་བཀང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་འབྱམ་ཀླས་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་བའི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་པ་ཉེ་བར་བསྒྲུབ་པ་མཐོང་ངོ་། །བ་སྤུའི་བུ་ག་ཐམས་ཅད་ལས་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མངོན་པར་འཐོན་ཏེ།
en: He saw that from all the pores on his body, from each of those pores, emerged multitudes of clouds of bodies of bodhisattvas, which were as numerous as the atoms in all buddha realms and which spread throughout the realm of phenomena, throughout the entire realm of space to its limits, accomplishing in the entire vast extent of buddha realms the roots of merit of developing and maintaining the first aspiration of all bodhisattvas.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་རྒྱ་མཚོ་ཐམས་ཅད་མངོན་པར་བརྗོད་པ་མཐོང་ངོ་།
en: He saw that from all the pores on his body, from each of those pores, emerged clouds of bodhisattvas, which were as numerous as the atoms in all buddha realms, reciting in all buddha realms the entire ocean of bodhisattva prayers in order to perform the completely pure conduct of Samanta­bhadra.

source: །བ་སྤུའི་བུ་ག་ཐམས་ཅད་ལས་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་དོན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པའི་སྤྲིན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡང་དག་པར་འབྱུང་བས་དགའ་བའི་ཤུགས་རྣམ་པར་འཕེལ་བར་བྱེད་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཆར་མངོན་པར་འཐོན་ནས་མངོན་པར་འབབ་པ་མཐོང་ངོ་།
en: He saw that from all the pores on his body, from each of those pores, in order to fulfill the aspirations of all beings, there emerged clouds of the bodhisattva Samanta­bhadra’s conduct, which were as numerous as the atoms in all buddha realms, increasing the power of joy through ascending toward omniscience and letting fall their rain.

source: །དེས་དེའི་བ་སྤུའི་བུ་ག་ཐམས་ཅད་ལས་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་སྟོན་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡང་དག་པར་འབྱུང་བའི་ཆོས་ཀྱི་སྤྲིན་ཆེན་པོ་རྣམ་པར་འཕེལ་བར་བྱེད་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མངོན་པར་འཐོན་པ་མཐོང་ངོ་།
en: He saw that from all the pores on his body, from each of those pores, emerged clouds of the attainment of buddhahood, manifesting the attainment of complete buddhahood in all buddha realms and increasing the great clouds of Dharma that ascend toward omniscience, which were as numerous as the atoms in all buddha realms.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་རྫུ་འཕྲུལ་གྱི་ཡུལ་དེ་ལྟ་བུ་མཐོང་ནས། དགའ་རངས་ཏེ་མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས། དེ་བས་ཀྱང་ཤས་ཆེར་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་ལུས་ལ་སེམས་སེམས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་ཡན་ལག་རེ་རེ་དང་། ཡན་ལག་རྣམ་པར་ཕྱེ་བ་རེ་རེ་དང་། ལུས་ཀྱི་ཆ་རེ་རེ་དང་། ལུས་ཀྱི་ཆ་རྣམ་པར་ཕྱེ་བ་རེ་རེ་དང་། ཡན་ལག་གི་ཕྱོགས་རེ་རེ་དང་། ཡན་ལག་གི་ཕྱོགས་རྣམ་པར་ཕྱེ་བ་རེ་རེ་དང་། ལུས་རེ་རེ་དང་། ལུས་རྣམ་པར་ཕྱེ་བ་རེ་རེ་དང་། བ་སྤུའི་བུ་ག་རེ་རེ་དང་བ་སྤུའི་བུ་ག་རྣམ་པར་ཕྱེ་བ་རེ་རེ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རླུང་གི་ཕུང་པོ་དང་བཅས། ཆུའི་ཕུང་པོ་དང་བཅས། སའི་ཕུང་པོ་དང་བཅས། མྱེའི་ཕུང་པོ་དང་བཅས། རྒྱ་མཚོ་དང་བཅས། གླིང་དང་བཅས། ཆུ་ཀླུང་དང་བཅས། རིན་པོ་ཆེའི་རི་དང་བཅས། རི་རབ་དང་བཅས། ཁོར་ཡུག་དང་བཅས།
en: Sudhana, the head merchant’s son, was overjoyed, pleased, delighted, thrilled, and blissful on seeing the scope of the bodhisattva Samanta­bhadra’s miracles, and he contempleted the bodhisattva Samanta­bhadra’s body even more strongly.

source: གྲོང་དང་གྲོང་ཁྱེར་དང་། ལྗོངས་དང་ཡུལ་དང་ཁམས་དང་རྒྱལ་པོའི་གནས་དང་བཅས། ནགས་ཚལ་དང་བཅས། ཁང་ཁྱིམ་དང་བཅས། སྐྱེ་བོའི་ཚོགས་དང་བཅས། སེམས་ཅན་དམྱལ་བའི་འཇིག་རྟེན་དང་བཅས། བྱོལ་སོང་གི་སྐྱེ་གནས་དང་བཅས། གཤིན་རྗེའི་འཇིག་རྟེན་དང་བཅས། ལྷ་མ་ཡིན་གྱི་འཇིག་རྟེན་དང་བཅས། ཀླུའི་འཇིག་རྟེན་དང་བཅས། ནམ་མཁའ་ལྡིང་གི་འཇིག་རྟེན་དང་བཅས། མྱིའི་འཇིག་རྟེན་དང་བཅས། ལྷའི་འཇིག་རྟེན་དང་བཅས། ཚངས་པའི་འཇིག་རྟེན་དང་བཅས། འདོད་པའི་ཁམས་ཀྱི་ཡུལ་དང་བཅས་གཟུགས་ཀྱི་ཁམས་ཀྱི་ཡུལ་དང་བཅས། གཟུགས་མེད་པའི་ཁམས་ཀྱི་ཡུལ་དང་བཅས། གཞི་དང་བཅས་རྟེན་དང་བཅས། དབྱིབས་དང་བཅས། སྤྲིན་དང་བཅས། གློག་དང་བཅས། སྐར་མ་དང་བཅས། ཉིན་ཞག་དང་བཅས། ཟླ་བ་ཕྱེད་དང་བཅས། ཟླ་བ་གཅིག་དང་བཅས། དུས་དང་བཅས། ལོ་དང་བཅས།
en: In each of the bodhisattva Samanta­bhadra’s limbs, in each section of his limbs, in each part of his body, in each section of the parts of his body, in each side of his limbs, in each section of the sides of his limbs, in each form, in each section of each form, in each pore, and in each section of each pore, he saw the images of this billion-world world realm with its mass of air, its mass of water, its mass of earth, its mass of fire, its oceans, its continents, its rivers, its mountains of jewels, its Sumerus , its Cakravālas , its villages, towns, districts, regions, realms, and royal capitals, its forests, its houses, its populations, its hells, its animal existences, its Yama realms, its asura realms, its nāga realms, its deva realms, its Brahmā realms, its range of desire realms, its range of form realms, its range of formless realms, its ground, its foundations, its shapes, its clouds, its lightning, its stars, its days and nights, its fortnights, its months, its seasons, its years, its intermediate kalpas, and its kalpas.

source: བསྐལ་བ་བར་མ་དང་བཅས་བསྐལ་པ་དང་བཅས་པར་གཟུགས་བརྙན་གྱི་ཚུལ་དུ་མཐོང་ངོ་། །འཇིག་རྟེན་གྱི་ཁམས་འདི་ལ་ཇི་ལྟ་བ་དེ་བཞིན་དུ། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱང་མཐོང་བར་གྱུར་ཏོ།
en: Just as he saw this world realm, he saw the images of all the world realms in the eastern direction.

source: །ཤར་ཕྱོགས་ལ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ཐམས་ཅད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་བྱུང་བ་དང་བཅས། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཀྱི་དཀྱིལ་འཁོར་དང་བཅས་པར་གཟུགས་བརྙན་གྱི་ཚུལ་དུ་མཐོང་བར་གྱུར་ཏོ། །དེས་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་སྔོན་གྱི་མཐའི་མུར་ཐུག་པའི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ།
en: Just as he saw those in the eastern direction, he also saw the world realms in the southern direction, in the western direction, in the northern direction, in the northeastern direction, in the southeastern direction, in the southwestern direction, in the northwestern direction, and in the downward and upward directions, together with their appearances of buddhas and their assemblies of bodhisattva followers.

source: ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་མྱི་ཆེན་པོའི་མཚན་རེ་རེ་ལས་སངས་རྒྱས་བྱུང་བ་དང་བཅས། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་བཅས། སེམས་ཅན་དང་བཅས། ཁང་ཁྱིམ་དང་བཅས། ཉིན་ཞག་དང་བཅས་བསྐལ་པ་དང་བཅས་པར་མཐོང་བར་གྱུར་ཏོ།
en: He also saw all the past successions of worlds in this Sahā world realm in each of the bodhisattva Samanta­bhadra’s physical signs of a great being, together with their appearances of buddhas, all their assemblies of bodhisattva followers, all their beings, all their houses, all their days and nights, and all their kalpas.

source: །དེ་བཞིན་ཏུ་ཕྱི་མའི་མཐའི་མུར་ཐུག་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འབྱམ་ཀླས་པ་ཐམས་ཅད་ཀྱང་མཐོང་བར་གྱུར་ཏོ།
en: In the same way, he saw the entire vast extent of its future buddha realms.
